In [1]:
# To start with, data will be aggregated by user ID and only users that visited the supermarket at least once in 2015 and 2013 
# will remain in the dataset.

#Identification of customers (staff members) who actually used their loyalty card in most transactions.
#-------------------------------------------------------------------------------------------------------#
## For example, there is a customer ID (from a loyalty card) attached to most transaction. 
## However, not every customer shopping in the supermarket has a loyalty card or uses it at the register. 
## If customer has no card, then a staff member on the register will use one of “generic” cards. 
## As a result, it looks as there are several customers buying too many products – much more than you might expect for 
## the “normal” customer. This is not true. These “super” customers were customers without loyalty cards and 
## staff members on the register used default cards.

# Check the project workspace and set paths for folders.

import os
os.chdir('G:\Customer Analytics in Large Organisations\Assignment 1')
path1 = r'G:\Customer Analytics in Large Organisations\Assignment 1\2013'
path2 = r'G:\Customer Analytics in Large Organisations\Assignment 1\2014'
path3 = r'G:\Customer Analytics in Large Organisations\Assignment 1\2015'
print("Project Workspace:", os.getcwd())
print()

# Import all necessary packages for the project.
import pandas as pd
import statistics as myStats
import glob
import numpy as np
from pandasql import sqldf

import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)

# Revome scientific notation to expand numbers in the dataset up to the
# second decimal place.
pd.set_option('display.float_format', lambda x: '%.4f' % x)
#pd.set_option('display.float_format', lambda x: '%,g' % x)

Project Workspace: G:\Customer Analytics in Large Organisations\Assignment 1

In [2]:
# Import data for each day and collate the data. For this, we create a function "importAndCollate1()" for year 2013.

def importAndCollate1():
    dataFileList = []
    fileNames = [fileName for fileName in glob.glob(path1 + "/*.csv", recursive = True)]
    for fileName in fileNames:
        dataFileList.append(pd.read_csv(fileName))
    year2013DataFile = pd.concat(dataFileList, ignore_index = False)
    print("Size of Dataset:", year2013DataFile.shape)
    return year2013DataFile

In [3]:
# Import data for each day and collate the data. For this, we create a function "importAndCollate2()" for year 2014.

def importAndCollate2():
    dataFileList = []
    fileNames = [fileName for fileName in glob.glob(path2 + "/*.csv", recursive = True)]
    for fileName in fileNames:
        dataFileList.append(pd.read_csv(fileName))
    year2014DataFile = pd.concat(dataFileList, ignore_index = False)
    print("Size of Dataset:", year2014DataFile.shape)
    return year2014DataFile

In [4]:
# Import data for each day and collate the data. For this, we create a function "importAndCollate3()" for year 2015.


def importAndCollate3():
    dataFileList = []
    fileNames = [fileName for fileName in glob.glob(path3 + "/*.csv", recursive = True)]
    for fileName in fileNames:
        dataFileList.append(pd.read_csv(fileName))
    year2015DataFile = pd.concat(dataFileList, ignore_index = False)
    print("Size of Dataset:", year2015DataFile.shape)
    return year2015DataFile

In [5]:
# Import all data for year 2013 and collate it in one dataframe.

year2013DataFile = importAndCollate1()

Size of Dataset: (12526008, 14)

In [6]:
#year2013DataFile.head(10)

In [7]:
# Import all data for year 2014 and collate it in one dataframe.

year2014DataFile = importAndCollate2()

G:\Installations\lib\site-packages\IPython\core\interactiveshell.py:3263: DtypeWarning: Columns (7) have mixed types.Specify dtype option on import or set low_memory=False.
  if (await self.run_code(code, result,  async_=asy)):

Size of Dataset: (12560113, 14)

In [8]:
# Import all data for year 2015 and collate it in one dataframe.

year2015DataFile = importAndCollate3()

Size of Dataset: (12285455, 14)

In [9]:
#year2013DataFile.to_csv(r'G:\Customer Analytics in Large Organisations\Assignment 1\Consolidated_2013.csv', index = False)

In [10]:
#year2014DataFile.to_csv(r'G:\Customer Analytics in Large Organisations\Assignment 1\Consolidated_2014.csv', index = False)

In [11]:
#year2015DataFile.to_csv(r'G:\Customer Analytics in Large Organisations\Assignment 1\Consolidated_2015.csv', index = False)

In [12]:
# Remove "NA" from "UniSA_Customer_No" and delete unnessary columns and values into a new data frame df1 for the year 2013 file.

year2013DataFile = year2013DataFile.dropna(subset=['UniSA_Customer_No'])
df1 = pd.DataFrame(data=year2013DataFile)
df1['UniSA_Customer_No'] = ['%.12g' % n for n in df1['UniSA_Customer_No']]
del df1['Sale_Time']
del df1['Barcode_Item']
del df1['Item_Description']
del df1['Department_Name']
del df1['Commodity_Name']
del df1['Offer']
df1

,Sale_Date,UniSA_Receipt_No1,Receipt_Line_No,UniSA_Customer_No,Total_Sale_Amount_InclusiveGST,Total_Receipt_Lines,Quantity_Sold,Item_Value
0,2013-01-02,734714,1,7016620670,5.1000,3,1.0000,1.9500
1,2013-01-02,734714,2,7016620670,5.1000,3,1.0000,1.9500
2,2013-01-02,734714,3,7016620670,5.1000,3,1.0000,1.2000
3,2013-01-02,734715,1,7497467924,3.4900,1,1.0000,3.4900
4,2013-01-02,871088,1,458487570,16.7500,5,1.0000,1.9900
...,...,...,...,...,...,...,...,...
40889,2013-12-31,501735,62,5823905204,215.9900,66,1.0000,0.9900
40890,2013-12-31,501735,63,5823905204,215.9900,66,1.0000,0.9900
40891,2013-12-31,501735,64,5823905204,215.9900,66,1.0000,0.9900
40892,2013-12-31,501735,65,5823905204,215.9900,66,1.0000,0.9900
40893,2013-12-31,501735,66,5823905204,215.9900,66,1.0000,0.9900

In [13]:
# Remove "NA" from "UniSA_Customer_No" and delete unnessary columns and values into a new data frame df2 for the year 2014 file.

year2014DataFile = year2014DataFile.dropna(subset=['UniSA_Customer_No'])
df2 = pd.DataFrame(data=year2014DataFile)
df2['UniSA_Customer_No'] = ['%.12g' % n for n in df2['UniSA_Customer_No']]
#del df2['Sale_Time']
del df2['Barcode_Item']
del df2['Item_Description']
del df2['Department_Name']
del df2['Commodity_Name']
del df2['Offer']
df2

,Sale_Date,Sale_Time,UniSA_Receipt_No1,Receipt_Line_No,UniSA_Customer_No,Total_Sale_Amount_InclusiveGST,Total_Receipt_Lines,Quantity_Sold,Item_Value
0,2014-01-02,08:03,50661,1,693320906,1.2000,1,1.0000,1.2000
1,2014-01-02,08:04,50662,1,3027124388,1.2000,1,1.0000,1.2000
2,2014-01-02,08:04,498614,1,2479711497,29.8900,1,1.0000,29.8900
3,2014-01-02,08:08,400888,1,555957017,11.3400,3,1.6400,6.2000
4,2014-01-02,08:08,400888,2,555957017,11.3400,3,1.0000,2.9900
...,...,...,...,...,...,...,...,...,...
52995,2014-12-31,NaN,516179,22,8078832382,197.8400,27,1.0000,17.5800
52996,2014-12-31,NaN,516179,23,8078832382,197.8400,27,3.0000,11.8500
52997,2014-12-31,NaN,516179,24,8078832382,197.8400,27,1.0000,5.5900
52998,2014-12-31,NaN,516179,25,8078832382,197.8400,27,1.0000,5.5900
52999,2014-12-31,NaN,516179,26,8078832382,197.8400,27,1.0000,9.9500

In [14]:
# Remove "NA" from "UniSA_Customer_No" and delete unnessary columns and values into a new data frame df3 for the year 2015 file.

year2015DataFile = year2015DataFile.dropna(subset=['UniSA_Customer_No'])
df3 = pd.DataFrame(data=year2015DataFile)
df3['UniSA_Customer_No'] = ['%.12g' % n for n in df3['UniSA_Customer_No']]
del df3['Sale_Time']
del df3['Barcode_Item']
del df3['Item_Description']
del df3['Department_Name']
del df3['Commodity_Name']
del df3['Offer']
df3

,Sale_Date,UniSA_Receipt_No1,Receipt_Line_No,UniSA_Customer_No,Total_Sale_Amount_InclusiveGST,Total_Receipt_Lines,Quantity_Sold,Item_Value
0,2015-01-02,51019,1,7416193812,94.9300,20,0.7250,3.6200
1,2015-01-02,51019,2,7416193812,94.9300,20,0.3842,7.6800
2,2015-01-02,51019,3,7416193812,94.9300,20,0.3222,6.4400
3,2015-01-02,51019,4,7416193812,94.9300,20,0.7337,7.3300
4,2015-01-02,51019,5,7416193812,94.9300,20,1.0462,6.7900
...,...,...,...,...,...,...,...,...
49481,2015-12-31,15123131049443,35,9333734328,179.0200,39,3.0000,11.9700
49482,2015-12-31,15123131049443,36,9333734328,179.0200,39,1.0000,1.1900
49483,2015-12-31,15123131049443,37,9333734328,179.0200,39,2.0000,3.4000
49484,2015-12-31,15123131049443,38,9333734328,179.0200,39,0.3000,4.5000
49485,2015-12-31,15123131049443,39,9333734328,179.0200,39,1.0000,15.9500

In [15]:
# Extracting unique "UniSA_Customer_No" from 2013 dataset.

sample1 = pd.DataFrame(df1['UniSA_Customer_No'].unique())
sample1.columns = ['UniSA_Customer_No']
sample1 = pd.to_numeric(sample1.UniSA_Customer_No, errors='coerce').convert_dtypes()
#sample1 = sorted(sample1.UniSA_Customer_No)
sample1 = pd.DataFrame(sample1)
sample1

       UniSA_Customer_No
0             7016620670
1             7497467924
2              458487570
3             3056310265
4             8064690113
...                  ...
13522         5416115839
13523         8651574448
13524         6236124408
13525         7105414532
13526         7406948374

[13527 rows x 1 columns]

In [16]:
# Extracting unique "UniSA_Customer_No" from 2014 dataset.

sample2 = pd.DataFrame(df2['UniSA_Customer_No'].unique())
sample2.columns = ['UniSA_Customer_No']
sample2 = pd.to_numeric(sample2.UniSA_Customer_No, errors='coerce').convert_dtypes()
#sample2 = sorted(sample2.UniSA_Customer_No)
sample2 = pd.DataFrame(sample2)
sample2

       UniSA_Customer_No
0              693320906
1             3027124388
2             2479711497
3              555957017
4             3353063604
...                  ...
13939         8124431616
13940         5949334180
13941         1067843598
13942         9116814303
13943         5670390056

[13944 rows x 1 columns]

In [17]:
# Extracting unique "UniSA_Customer_No" from 2015 dataset.

sample3 = pd.DataFrame(df3['UniSA_Customer_No'].unique())
sample3.columns = ['UniSA_Customer_No']
sample3 = pd.to_numeric(sample3.UniSA_Customer_No, errors='coerce').convert_dtypes()
#sample3 = sorted(sample3.UniSA_Customer_No)
sample3 = pd.DataFrame(sample3)
sample3

       UniSA_Customer_No
0             7416193812
1             3916558406
2             7124281871
3              693320906
4             4882665034
...                  ...
13714         9626430536
13715         4835576138
13716         2283369945
13717         2603142902
13718         4454215213

[13719 rows x 1 columns]

In [ ]:
#sample1.to_csv(r'G:\Customer Analytics in Large Organisations\Assignment 1\sample1.csv', index = False)

In [ ]:
#sample2.to_csv(r'G:\Customer Analytics in Large Organisations\Assignment 1\sample2.csv', index = False)

In [ ]:
#sample3.to_csv(r'G:\Customer Analytics in Large Organisations\Assignment 1\sample3.csv', index = False)

In [ ]:
# Finding sample both samples of 2013 and 2014.

#pysqldf = lambda q: sqldf(q, globals())
#q = """SELECT a.UniSA_Customer_No, b.UniSA_Customer_No
#       FROM 
#           sample1 a
#       INNER JOIN 
#           sample2 b
#        ON a.UniSA_Customer_No = b.UniSA_Customer_No;"""
#
#join = pysqldf(q)
#joined = pd.DataFrame(join)
#joined

In [18]:
joined1 = pd.merge(sample2,sample1,on='UniSA_Customer_No')
joined1

       UniSA_Customer_No
0              693320906
1             3027124388
2             2479711497
3              555957017
4             3353063604
...                  ...
12123         3655011541
12124         6206177823
12125         6992424316
12126         8124431616
12127         5949334180

[12128 rows x 1 columns]

In [19]:
joined2 = pd.merge(joined1,sample3,on='UniSA_Customer_No')
joined2

       UniSA_Customer_No
0              693320906
1             3027124388
2             2479711497
3              555957017
4             3353063604
...                  ...
11000         2473514537
11001         9626430536
11002          496926624
11003         8124431616
11004         5949334180

[11005 rows x 1 columns]

In [20]:
# Check all the records of "df2" (2014 dataset) who are in intersection dataset (joined2).

df2['UniSA_Customer_No'] = pd.to_numeric(df2.UniSA_Customer_No, errors='coerce').convert_dtypes()
final = pd.merge(df2,joined2, on='UniSA_Customer_No', how = 'inner')
final

,Sale_Date,Sale_Time,UniSA_Receipt_No1,Receipt_Line_No,UniSA_Customer_No,Total_Sale_Amount_InclusiveGST,Total_Receipt_Lines,Quantity_Sold,Item_Value
0,2014-01-02,08:03,50661,1,693320906,1.2000,1,1.0000,1.2000
1,2014-01-02,08:23,584701,1,693320906,158.6700,31,1.0000,2.9900
2,2014-01-02,08:23,584701,2,693320906,158.6700,31,1.0000,7.0000
3,2014-01-02,08:23,584701,3,693320906,158.6700,31,1.0000,7.0000
4,2014-01-02,08:23,584701,4,693320906,158.6700,31,1.0000,4.2900
...,...,...,...,...,...,...,...,...,...
11500152,2014-12-31,11:32:39,47047,35,5949334180,185.5500,36,1.0000,6.3500
11500153,2014-12-31,11:32:39,47047,36,5949334180,185.5500,36,1.0000,2.7500
11500154,2014-12-31,11:32:39,47047,37,5949334180,185.5500,36,1.0000,2.7500
11500155,2014-12-31,11:32:39,47047,38,5949334180,185.5500,36,1.0000,2.7500
11500156,2014-12-31,11:32:39,47047,39,5949334180,185.5500,36,1.0000,2.9900

In [21]:
#final.to_csv(r'G:\Customer Analytics in Large Organisations\Assignment 1\Final_2014.csv', index = False)

In [22]:
#final.head(10)

In [23]:
# Creating a new variable "Key" which is combination of "UniSA_Customer_No" and "Sale_Date"

#final['UniSA_Customer_No'] = final['UniSA_Customer_No'].astype(str)
#final['Key'] = final['UniSA_Customer_No'] + final['Sale_Date']
#final.Key = final.Key.str.replace('[-,.]', '')
#final

In [24]:
# Create a loop to run for each day and find out the occurence of variable "Key" more than 3 times. 
# If a customer is visiting more than 3 times a day and buying too much, there is high probability of being a "super customer".

#Sale_Dt = [final.Sale_Date, Key]

#for x in Sale_Dt:
#    kcount = count(key)
#    if kcount > 3
#        print(marks[student])
#        break
#else:
#    print('No entry with that name found.')

In [25]:
#if isinstance(sample1, pd.DataFrame):
#    print('Yes')
#else:
#    print('No')

In [26]:
# Clustering and Segmentation Analysis

# Import all necessary packages for the project.
from sklearn.decomposition import PCA as sklearnPCA
from sklearn.cluster import DBSCAN as sklearnDBSCAN
import seaborn as sb
from scipy.cluster.hierarchy import dendrogram, linkage, fcluster
from matplotlib import pyplot as plt

pd.options.mode.chained_assignment = None

In [27]:
# From the "Sale Date" data, we get the day, month and date columns for each transaction.

def fetchMonthAndYearColumns(dataFile):
    dataFile["Day"] = dataFile["Sale_Date"].apply(lambda month: month.split("-")[2])
    dataFile["Month"] = dataFile["Sale_Date"].apply(lambda month: month.split("-")[1])
    dataFile["Year"] = dataFile["Sale_Date"].apply(lambda year: year.split("-")[0])
    dataFile.drop(columns = ["Sale_Date"])
    return dataFile

In [28]:
# Assigning "final" dataset to "yearDataFile" as new dataset so that changes can be made accordingly.

yearDataFile = final
#yearDataFile['Total_Quantity_Sold'] = yearDataFile['Quantity_Sold'].sum()

In [29]:
# Transform the "Sale Date" column into three different columns, one each for "Sale Day", "Sale Month" and "Sale Year".

yearDataFile = fetchMonthAndYearColumns(yearDataFile)
yearDataFile.head(50)

,Sale_Date,Sale_Time,UniSA_Receipt_No1,Receipt_Line_No,UniSA_Customer_No,Total_Sale_Amount_InclusiveGST,Total_Receipt_Lines,Quantity_Sold,Item_Value,Day,Month,Year
0,2014-01-02,08:03,50661,1,693320906,1.2000,1,1.0000,1.2000,02,01,2014
1,2014-01-02,08:23,584701,1,693320906,158.6700,31,1.0000,2.9900,02,01,2014
2,2014-01-02,08:23,584701,2,693320906,158.6700,31,1.0000,7.0000,02,01,2014
3,2014-01-02,08:23,584701,3,693320906,158.6700,31,1.0000,7.0000,02,01,2014
4,2014-01-02,08:23,584701,4,693320906,158.6700,31,1.0000,4.2900,02,01,2014
5,2014-01-02,08:23,584701,5,693320906,158.6700,31,1.0000,4.2900,02,01,2014
6,2014-01-02,08:23,584701,6,693320906,158.6700,31,3.0000,2.6700,02,01,2014
7,2014-01-02,08:23,584701,7,693320906,158.6700,31,1.0000,4.1900,02,01,2014
8,2014-01-02,08:23,584701,8,693320906,158.6700,31,1.0000,4.1900,02,01,2014
9,2014-01-02,08:23,584701,9,693320906,158.6700,31,1.0000,4.1900,02,01,2014
10,2014-01-02,08:23,584701,10,693320906,158.6700,31,1.0000,4.1900,02,01,2014
11,2014-01-02,08:23,584701,11,693320906,158.6700,31,1.0000,4.1900,02,01,2014
12,2014-01-02,08:23,584701,12,693320906,158.6700,31,8.0000,6.0000,02,01,2014
13,2014-01-02,08:23,584701,13,693320906,158.6700,31,1.0000,1.7000,02,01,2014
14,2014-01-02,08:23,584701,14,693320906,158.6700,31,6.0000,12.0000,02,01,2014
15,2014-01-02,08:23,584701,15,693320906,158.6700,31,6.0000,12.0000,02,01,2014
16,2014-01-02,08:23,584701,16,693320906,158.6700,31,1.0000,2.8200,02,01,2014
17,2014-01-02,08:23,584701,17,693320906,158.6700,31,0.4400,3.0900,02,01,2014
18,2014-01-02,08:23,584701,18,693320906,158.6700,31,0.5100,6.6000,02,01,2014
19,2014-01-02,08:23,584701,19,693320906,158.6700,31,1.0000,5.9900,02,01,2014
20,2014-01-02,08:23,584701,20,693320906,158.6700,31,1.0000,8.6700,02,01,2014
21,2014-01-02,08:23,584701,21,693320906,158.6700,31,1.0000,6.8900,02,01,2014
22,2014-01-02,08:23,584701,22,693320906,158.6700,31,1.0000,3.9900,02,01,2014
23,2014-01-02,08:23,584701,23,693320906,158.6700,31,2.0000,7.9800,02,01,2014
24,2014-01-02,08:23,584701,24,693320906,158.6700,31,0.0700,1.7500,02,01,2014
25,2014-01-02,08:23,584701,25,693320906,158.6700,31,1.9400,7.3300,02,01,2014
26,2014-01-02,08:23,584701,26,693320906,158.6700,31,0.3000,5.9000,02,01,2014
27,2014-01-02,08:23,584701,27,693320906,158.6700,31,2.0000,5.9800,02,01,2014
28,2014-01-02,08:23,584701,28,693320906,158.6700,31,1.0000,1.9900,02,01,2014
29,2014-01-02,08:23,584701,29,693320906,158.6700,31,1.0000,3.2900,02,01,2014
30,2014-01-02,08:23,584701,30,693320906,158.6700,31,1.0000,3.2900,02,01,2014
31,2014-01-02,08:23,584701,31,693320906,158.6700,31,0.4500,2.2200,02,01,2014
32,2014-01-02,08:25,400890,1,693320906,3.3400,1,2.0000,3.3400,02,01,2014
33,2014-01-02,09:49,50094,1,693320906,2.7900,1,1.0000,2.7900,02,01,2014
34,2014-01-02,10:26,382857,1,693320906,5.9900,1,1.0000,5.9900,02,01,2014
35,2014-01-02,11:59,50681,1,693320906,26.8200,3,6.0000,12.0000,02,01,2014
36,2014-01-02,11:59,50681,2,693320906,26.8200,3,6.0000,12.0000,02,01,2014
37,2014-01-02,11:59,50681,3,693320906,26.8200,3,1.0000,2.8200,02,01,2014
38,2014-01-02,16:04,584861,1,693320906,22.4600,6,1.0000,2.0000,02,01,2014
39,2014-01-02,16:04,584861,2,693320906,22.4600,6,4.0000,8.0000,02,01,2014
40,2014-01-02,16:04,584861,3,693320906,22.4600,6,1.0000,0.9900,02,01,2014
41,2014-01-02,16:04,584861,4,693320906,22.4600,6,1.0000,1.9900,02,01,2014
42,2014-01-02,16:04,584861,5,693320906,22.4600,6,1.0000,4.4900,02,01,2014
43,2014-01-02,16:04,584861,6,693320906,22.4600,6,1.0000,4.9900,02,01,2014
44,2014-01-03,08:01,50042,1,693320906,1.2000,1,1.0000,1.2000,03,01,2014
45,2014-01-03,08:15,401110,1,693320906,110.9100,21,1.0000,7.0000,03,01,2014
46,2014-01-03,08:15,401110,2,693320906,110.9100,21,1.0000,3.4900,03,01,2014
47,2014-01-03,08:15,401110,3,693320906,110.9100,21,3.0000,2.6700,03,01,2014
48,2014-01-03,08:15,401110,4,693320906,110.9100,21,1.0000,4.0900,03,01,2014
49,2014-01-03,08:15,401110,5,693320906,110.9100,21,1.0000,4.0900,03,01,2014

In [ ]:
# Finding all rows with "Quantity Sold" less than 1.
    
#test1 = yearDataFile["Quantity_Sold"][yearDataFile["Quantity_Sold"] < 1.0] 
#test1.count()

In [ ]:
# Finding all rows with "Quantity Sold" greater than 0 but less than 1.
    
#test2 = yearDataFile[(yearDataFile['Quantity_Sold'] > 0) & (yearDataFile['Quantity_Sold'] <1)]
#test2

Now we cannot delete these customers as they made a trip to return a item or multiple items.
As they satisfy the conditions of -
1. Trip Made
2. They purchased some item (however returned later)
3. Money spent

In [ ]:
#test3 = yearDataFile[(yearDataFile['UniSA_Customer_No'] == 10854648 ) & (yearDataFile['Sale_Date'] == '2014-01-02')]
#test3

In [ ]:
# Ensure that the minimum value for "Quantity Sold" is "1".
    
# dataFile["Quantity_Sold"][dataFile["Quantity_Sold"] < 1.0] = 1

In [ ]:
#test4 = GroupDay[(GroupDay['UniSA_Customer_No'] == 10854648) & (GroupDay['Month'] == '03')]
#test4

In [ ]:
#test5 = yearDataFile[(yearDataFile['UniSA_Customer_No'] == 299827) & (yearDataFile['Month'] == '02')]
#test5

In [ ]:
#test7 = GroupYear[(GroupYear['Total_Quantity_Sold'] > 10000)]
#test7

In [30]:
# First aggregate over a day.

# yearDataFile['ReceiptID'] = yearDataFile['UniSA_Receipt_No1']


aggregations1 = {
   "Quantity_Sold": "sum",
   "Item_Value": "sum",
   "UniSA_Receipt_No1": pd.Series.nunique
}

GroupDay = yearDataFile.groupby(by = ["Day", "Month", "Year", "UniSA_Customer_No"], as_index = False).agg(aggregations1).rename(columns = {"UniSA_Receipt_No1": "No_of_Trips", "Item_Value": "Total_Sale_Amount"})
GroupDay

,Day,Month,Year,UniSA_Customer_No,Quantity_Sold,Total_Sale_Amount,No_of_Trips
0,01,02,2014,1925237,58.5300,267.8800,2
1,01,02,2014,10854648,17.2100,87.0400,2
2,01,02,2014,16000817,62.6200,195.4700,1
3,01,02,2014,18665420,4.0000,14.2600,1
4,01,02,2014,20347777,8.0000,48.7900,1
...,...,...,...,...,...,...,...
635102,31,12,2014,9984705419,16.7375,69.7300,1
635103,31,12,2014,9985573496,0.4800,2.1700,1
635104,31,12,2014,9988026417,26.7070,98.7100,1
635105,31,12,2014,9988090575,1.0000,3.7400,1
635106,31,12,2014,9993879211,4.0000,10.3900,1

In [31]:
# Then aggregate over a month.

GroupMonth = GroupDay.groupby(by = ["Month", "Year", "UniSA_Customer_No"], as_index = False).agg({"No_of_Trips": "sum", "Total_Sale_Amount": "sum", "Quantity_Sold": "sum"}).rename(columns = {"No_of_Trips": "Monthly_Total_Trips", "Quantity_Sold": "Total_Quantity_Sold"})
GroupMonth.head(20)

,Month,Year,UniSA_Customer_No,Monthly_Total_Trips,Total_Sale_Amount,Total_Quantity_Sold
0,01,2014,299827,13,753.7600,199.0200
1,01,2014,1925237,16,1561.1700,230.7100
2,01,2014,3004639,4,397.8100,112.3200
3,01,2014,5225820,4,44.5200,11.5300
4,01,2014,5714956,1,4.6800,3.0000
5,01,2014,6312990,6,545.3400,138.3900
6,01,2014,6652575,1,82.0000,26.1600
7,01,2014,7180839,5,218.6700,46.1100
8,01,2014,8617739,2,210.0200,60.6100
9,01,2014,9826891,7,382.2800,78.7600
10,01,2014,10854648,35,1436.9100,336.9300
11,01,2014,12962240,1,47.7900,7.2200
12,01,2014,13352077,8,565.5200,121.8300
13,01,2014,13464112,2,87.2100,4.0000
14,01,2014,14375092,9,509.4700,153.8000
15,01,2014,15032964,2,223.5700,52.8300
16,01,2014,16000817,14,1030.0000,284.2500
17,01,2014,16406306,14,362.3600,99.9200
18,01,2014,16978194,4,111.6200,47.1900
19,01,2014,17411245,4,178.2300,26.4900

In [32]:
#test6 = GroupMonth[(GroupMonth["Monthly_Total_Trips"] >= 4) & (GroupMonth["Monthly_Total_Trips"] <= 31)]
#test6

In [33]:
# And finally aggregate over a year

GroupYear = GroupMonth.groupby(by = ["Year", "UniSA_Customer_No"], as_index = False).agg({"Monthly_Total_Trips": "sum", "Total_Sale_Amount": "sum", "Total_Quantity_Sold": "sum"}).rename(columns = {"Monthly_Total_Trips": "Total_Trips", "Total_Sale_Amount": "Total_Sale_Amount", "Total_Quantity_Sold": "Total_Quantity_Sold"})
GroupYear["Total_Trips"] = GroupYear["Total_Trips"].round()    
GroupYear["Total_Quantity_Sold"] = GroupYear["Total_Quantity_Sold"].round()
GroupYear

,Year,UniSA_Customer_No,Total_Trips,Total_Sale_Amount,Total_Quantity_Sold
0,2014,299827,133,6586.0800,1732.0000
1,2014,1925237,174,13612.4192,2838.0000
2,2014,2984536,6,742.8900,167.0000
3,2014,3004639,19,1824.3800,462.0000
4,2014,5225820,17,171.3100,37.0000
...,...,...,...,...,...
11000,2014,9993952646,29,2098.9700,565.0000
11001,2014,9994391298,9,1449.5800,284.0000
11002,2014,9994971948,61,2663.2694,819.0000
11003,2014,9996877212,5,540.2900,90.0000
11004,2014,9997118084,86,4233.7100,1161.0000

In [34]:
GroupYear["Total_Trips"].sum()

815748

In [35]:
# Super Customers

SuperCustomers = GroupDay[GroupDay['No_of_Trips'] > 7]
SuperCustomers

,Day,Month,Year,UniSA_Customer_No,Quantity_Sold,Total_Sale_Amount,No_of_Trips
1711,01,02,2014,9333734328,1641.6500,7854.0900,236
3425,01,03,2014,9333734328,1932.7300,8746.4900,258
5234,01,04,2014,9333734328,2310.7700,10019.9000,299
7238,01,05,2014,9333734328,2761.6400,11389.5600,325
8427,01,06,2014,9333734328,1270.4100,5844.8100,210
...,...,...,...,...,...,...,...
629534,31,07,2014,9333734328,2306.9000,10410.7700,268
630749,31,08,2014,9333734328,2146.8700,9112.4600,265
630979,31,10,2014,693320906,80.6102,199.6100,8
632654,31,10,2014,9333734328,1202.1341,5368.4100,69
634961,31,12,2014,9333734328,1099.2127,5054.0400,107

In [36]:
 # Normal Customers
    
NormalCustomers = GroupDay[GroupDay['No_of_Trips'] <= 7]
NormalCustomers

,Day,Month,Year,UniSA_Customer_No,Quantity_Sold,Total_Sale_Amount,No_of_Trips
0,01,02,2014,1925237,58.5300,267.8800,2
1,01,02,2014,10854648,17.2100,87.0400,2
2,01,02,2014,16000817,62.6200,195.4700,1
3,01,02,2014,18665420,4.0000,14.2600,1
4,01,02,2014,20347777,8.0000,48.7900,1
...,...,...,...,...,...,...,...
635102,31,12,2014,9984705419,16.7375,69.7300,1
635103,31,12,2014,9985573496,0.4800,2.1700,1
635104,31,12,2014,9988026417,26.7070,98.7100,1
635105,31,12,2014,9988090575,1.0000,3.7400,1
635106,31,12,2014,9993879211,4.0000,10.3900,1

In [37]:
NormalCustomers['Quantity_Sold'].describe()

count   634694.0000
mean        16.9138
std         18.5543
min        -97.0000
25%          4.8450
50%         10.0357
75%         22.5000
max       2003.0000
Name: Quantity_Sold, dtype: float64

In [38]:
SuperCustomers['Quantity_Sold'].describe()

count    413.0000
mean    1824.3500
std      983.6811
min       24.0500
25%     1244.2400
50%     1968.0500
75%     2503.4200
max     6500.9500
Name: Quantity_Sold, dtype: float64

In [ ]:
NormalCustomers['Total_Sale_Amount'].describe()

In [ ]:
SuperCustomers['Total_Sale_Amount'].describe()

In [ ]:
NormalCustomers['No_of_Trips'].describe()

In [ ]:
SuperCustomers['No_of_Trips'].describe()

In [ ]:
SuperCustomers.median()

In [ ]:
NormalCustomers.median()

In [ ]:
# Aggregate the data for each month by "UniSA Customer Number" and "Month of Sale" to get "No of Trips per day", 
# "No of Purchases" and the "Total Sale Amount Inclusive of GST".

Clustering = yearDataFile

def aggregateYearData(Clustering):
    aggregations1 = {
    'Quantity_Sold': "sum",
    "Item_Value": "sum",
    "UniSA_Receipt_No1": pd.Series.nunique
    }
    
    # First aggregate over a day.
    
    Clustering = Clustering.groupby(by = ["Day", "Month", "Year", "UniSA_Customer_No"], as_index = False).agg(aggregations1).rename(columns = {"UniSA_Receipt_No1": "No_of_Trips", "Item_Value": "Total_Sale_Amount"})
    
    # Super Customers
    SuperCustomers = Clustering[Clustering['No_of_Trips'] > 7]
    
    # Eliminate all those customers who made more than 7 trips in a day.
    Clustering = Clustering[Clustering['No_of_Trips'] <= 7]
    
    print("Size of Dataset:", Clustering.shape)
    print("Number of Super Customers:", SuperCustomers.shape)
    
    # Then aggregate over a month.
    Clustering = Clustering.groupby(by = ["Month", "Year", "UniSA_Customer_No"], as_index = False).agg({"No_of_Trips": "sum", "Total_Sale_Amount": "sum", "Quantity_Sold": "sum"}).rename(columns = {"No_of_Trips": "Monthly_Total_Trips", "Quantity_Sold": "Total_Quantity_Sold"})
    print("Size of Dataset:", Clustering.shape)
    #Clustering = Clustering[(Clustering["Monthly_Total_Trips"] >= 4) & (Clustering["Monthly_Total_Trips"] <= 31)]
    
    # And finally aggregate over a year
    Clustering = Clustering.groupby(by = ["Year", "UniSA_Customer_No"], as_index = False).agg({"Monthly_Total_Trips": "mean", "Total_Sale_Amount": "mean", "Total_Quantity_Sold": "mean"}).rename(columns = {"Monthly_Total_Trips": "Average_Trips", "Total_Sale_Amount": "Average_Sale_Amount", "Total_Quantity_Sold": "Average_Quantity_Sold"})
    Clustering["Average_Trips"] = Clustering["Average_Trips"].round()    
    Clustering["Average_Quantity_Sold"] = Clustering["Average_Quantity_Sold"].round()
    print("Size of Dataset:", Clustering.shape)
    return Clustering

In [ ]:
# Aggregate the data over each month to get "Number of Trips in a Month",
# "Average Sale Amount" and "Quantity Sold" to each loyal "UniSA Customer Number".

aggregatedYearlyData = aggregateYearData(Clustering)
aggregatedYearlyData.head(10)

In [ ]:
#test7 = aggregatedYearlyData[(aggregatedYearlyData['UniSA_Customer_No'] == 10854648)]
#test7

In [ ]:
#test8 = GroupMonth[(GroupMonth['UniSA_Customer_No'] == 10854648)]
#test8

In [ ]:
#test9 = GroupYear[(GroupYear['UniSA_Customer_No'] == 10854648)]
#test9

In [ ]:
import seaborn as sn
import matplotlib.pyplot as plt

df = pd.DataFrame(aggregatedYearlyData,columns=['Average_Trips','Average_Sale_Amount','Average_Quantity_Sold'])
corrMatrix = df.corr()
sn.heatmap(corrMatrix, annot=True)
plt.show()

In [ ]:
# Let's explore the different customer segments for the entire year using different clustering techniques. 
# Each "UniSA Customer Number" is a point in three dimensions: "Average Number of Trips" "Average Sale Amount", 
# and "Average Quantity Sold". 
# Before that we normalize our data.

aggregatedYearlyDataForPCA = aggregatedYearlyData[["Average_Trips", "Average_Sale_Amount", "Average_Quantity_Sold"]]
aggregatedYearlyDataForPCA["Average_Trips"] = (aggregatedYearlyDataForPCA["Average_Trips"] - myStats.mean(aggregatedYearlyDataForPCA["Average_Trips"])) / myStats.stdev(aggregatedYearlyDataForPCA["Average_Trips"])
aggregatedYearlyDataForPCA["Average_Sale_Amount"] = (aggregatedYearlyDataForPCA["Average_Sale_Amount"] - myStats.mean(aggregatedYearlyDataForPCA["Average_Sale_Amount"])) / myStats.stdev(aggregatedYearlyDataForPCA["Average_Sale_Amount"])
aggregatedYearlyDataForPCA["Average_Quantity_Sold"] = (aggregatedYearlyDataForPCA["Average_Quantity_Sold"] - myStats.mean(aggregatedYearlyDataForPCA["Average_Quantity_Sold"])) / myStats.stdev(aggregatedYearlyDataForPCA["Average_Quantity_Sold"])

In [ ]:
aggregatedYearlyDataForPCA

In [ ]:
# Before we proceed, let's plot our data to get an idea of the different customer segements that may exist. 
# Our data is three dimensional, but we need to plot it in two dimensions. For this we'll use Principal Component Analysis. 
# We create an object for Principal Component Analysis (PCA).

pCA = sklearnPCA(n_components = 2)
pCAYearData = pd.DataFrame(pCA.fit_transform(aggregatedYearlyDataForPCA))
pCAYearData.columns = ["Principal Component 1", "Principal Component 2"]
pCAYearData.index = aggregatedYearlyData["UniSA_Customer_No"]
aggregatedYearlyDataForPCA.index = aggregatedYearlyData["UniSA_Customer_No"]
aggregatedYearlyData.index = aggregatedYearlyData["UniSA_Customer_No"]
figure = sb.scatterplot(x = pCAYearData["Principal Component 1"], y = pCAYearData["Principal Component 2"])
sb.set(rc={'figure.figsize':(17.7,8.27)})
figure.set_xlabel("Principal Component 1",fontsize=15)
figure.set_ylabel("Principal Component 2",fontsize=15)
figure

In [ ]:
# The PCA scatterplot for shows two groups, of which one group might be outliers
# To deal with such data, we use the DBSCAN Clustering method for customer segmentation.

dbscanClustering = sklearnDBSCAN(eps = 3, min_samples = 10).fit(aggregatedYearlyDataForPCA)
clusterNumbers = [cluster + 1 for cluster in dbscanClustering.labels_.tolist()]
aggregatedYearlyDataForPCA["Cluster"] = clusterNumbers
pCAYearData.columns = ["0", "1"]
pCAYearData["Cluster"] = clusterNumbers
aggregatedYearlyData["Cluster"] = clusterNumbers
scatterPlot = sb.scatterplot(x = pCAYearData["0"], y = pCAYearData["1"], hue = pCAYearData["Cluster"], data = pCAYearData)
sb.set(rc={'figure.figsize':(17.7,8.27)})
scatterPlot.set_xlabel("Principal Component 1",fontsize=15)
scatterPlot.set_ylabel("Principal Component 2",fontsize=15)
scatterPlot

In [ ]:
# It is evident that there are three outliers which will cause problems while clustering our data. 
# For this reason, we remove the outlier belonging to cluster "0".

outlierRecordIndices = pCAYearData[pCAYearData["Cluster"] == 0].index.tolist()
outlierRecordIndices
pCAYearData = pCAYearData.drop(outlierRecordIndices, axis = 0)
aggregatedYearlyDataForPCA = aggregatedYearlyDataForPCA.drop(outlierRecordIndices, axis = 0)
aggregatedYearlyData = aggregatedYearlyData.drop(outlierRecordIndices, axis = 0)
scatterPlot = sb.scatterplot(x = pCAYearData["0"], y = pCAYearData["1"], hue = pCAYearData["Cluster"], data = pCAYearData)
scatterPlot.set_xlabel("Principal Component 1",fontsize=15)
scatterPlot.set_ylabel("Principal Component 2",fontsize=15)
scatterPlot

In [ ]:
# Next, we add these segment details to our aggregated data.

#DataBackup1 = aggregatedYearlyData
#DataBackup1["Segment_No"] = dbscanClustering
#DataBackup1

In [ ]:
#test10 = DataBackup1[(DataBackup1['Cluster'] == 0)]
#test10

In [ ]:
#test11 = DataBackup1[(DataBackup1['Cluster'] == 1) & (DataBackup1["Average_Trips"] < 76)]
#test11

In [ ]:
# We can see that there are no distinct groups in the data. Let's try using Herarchical Clustering methods.

linked = linkage(pCAYearData, method = "ward")

labelList = pCAYearData.index.tolist()

plt.figure(figsize = (10, 8))  
heirarchicalClustering = dendrogram(linked, orientation = "top", labels = labelList, distance_sort = "descending", show_leaf_counts = True, color_threshold = 55)
plt.title('Dendrogram')
plt.ylabel('Euclidean Distances')
plt.show()   

#import scipy.cluster.hierarchy as sch

#dendrogram = sch.dendrogram(sch.linkage(pCAYearData, method  = "ward"))
#plt.title('Dendrogram')
#plt.xlabel('Customers')
#plt.ylabel('Euclidean distances')
#plt.show()

In [ ]:
# We see that there are three possible segments of customers for the year 2014.
# We need to extract the segment numbers for each segment.

heirarchicalClustering = fcluster(linked, t = 60, depth = 4, criterion = "distance")

# Next, we add these segment details to our aggregated data.
aggregatedYearlyData["Segment_No"] = heirarchicalClustering


# Let's check the distribution of "UniSA Customer Numbers" based on "Average Number of Trips made per Month", 
# "Average Sale Amount for the Month" and "Average Quantity Sold."


# Let's create box plots for "Average Number of Trips made".
plt.figure()
boxPlotAverageNoOfTrips = sb.boxplot(x = "Segment_No", y = "Average_Trips", data = aggregatedYearlyData)
boxPlotAverageNoOfTrips.set(xlabel = "Segment No.", ylabel = "Average Trips per Year")
boxPlotAverageNoOfTrips.set_xlabel("Segment No",fontsize=15)
boxPlotAverageNoOfTrips.set_ylabel("Average Trips per Year",fontsize=15)

# Let's create box plots for "Average Sale Amount".
plt.figure()
boxPlotAverageSaleAmount = sb.boxplot(x = "Segment_No", y = "Average_Sale_Amount", data = aggregatedYearlyData)
boxPlotAverageSaleAmount.set(xlabel = "Segment No.", ylabel = "Average Spending per Year")
boxPlotAverageSaleAmount.set_xlabel("Segment No",fontsize=15)
boxPlotAverageSaleAmount.set_ylabel("Average Spending per Year",fontsize=15)

# Let's create box plots for "Average Quantity Sold to the Customer".
plt.figure()
boxPlotAverageQuantitySold = sb.boxplot(x = "Segment_No", y = "Average_Quantity_Sold", data = aggregatedYearlyData)
boxPlotAverageQuantitySold.set(xlabel = "Segment No.", ylabel = "Average No. of Products Purchased per Year")
boxPlotAverageQuantitySold.set_xlabel("Segment No",fontsize=15)
boxPlotAverageQuantitySold.set_ylabel("Average No. of Products Purchased per Year",fontsize=15)

In [ ]:
aggregatedYearlyData

In [ ]:
hresult1 = pd.DataFrame(aggregatedYearlyData[aggregatedYearlyData["Segment_No"] == 1])
hresult1

In [ ]:
hresult2 = pd.DataFrame(aggregatedYearlyData[aggregatedYearlyData["Segment_No"] == 2])
hresult2

In [ ]:
hresult3 = pd.DataFrame(aggregatedYearlyData[aggregatedYearlyData["Segment_No"] == 3])
hresult3

In [ ]:
hresult4 = pd.DataFrame(aggregatedYearlyData[aggregatedYearlyData["Segment_No"] == 4])
hresult4

In [ ]:
Describe1 = hresult1[['Average_Trips', 'Average_Sale_Amount', 'Average_Quantity_Sold']]
Describe1.describe()

In [ ]:
Describe2 = hresult2[['Average_Trips', 'Average_Sale_Amount', 'Average_Quantity_Sold']]
Describe2.describe()

In [ ]:
Describe3 = hresult3[['Average_Trips', 'Average_Sale_Amount', 'Average_Quantity_Sold']]
Describe3.describe()

In [ ]:
Describe4 = hresult4[['Average_Trips', 'Average_Sale_Amount', 'Average_Quantity_Sold']]
Describe4.describe()

In [ ]:
# RFM Segmentation Analysis

# Finding Sale_Time_Length to set seconds for missing Sale_Time.

RFM = yearDataFile

RFM["Sale_Time"][RFM["Sale_Time"] == 'nan'] = "00:00:00"

RFM['Sale_Time'] = RFM['Sale_Time'].astype(str)
RFM['Sale_Time_Length'] = RFM['Sale_Time'].astype(str).map(len)

Seconds = ':00'
RFM["Sale_Time"][RFM["Sale_Time_Length"] == 5] = RFM["Sale_Time"] + Seconds

#Creating a new variable "Time Stamp"

RFM['TimeStamp'] = RFM["Sale_Date"] + " " + RFM["Sale_Time"]

RFM

In [ ]:
# What is the time frame of the data?

print('Orders from {} to {}'.format(RFM['TimeStamp'].min(),
                                    RFM['TimeStamp'].max()))

In [ ]:
#orders = RFM.groupby(['UniSA_Receipt_No1', 'Sale_Date', 'UniSA_Customer_No']).agg({'Item_Value': lambda x: x.sum()}).reset_index().rename(columns = {"UniSA_Receipt_No1": "InvoiceNo", "Sale_Date": "InvoiceDate", "UniSA_Customer_No": "CustomerID", "Item_Value": "Total_Sale_Amount"})
#orders.head(20)

In [ ]:
# Calculate the recent date which in this case will be 2015-01-01.

from datetime import timedelta

NOW = pd.to_datetime(RFM['TimeStamp']).max() + timedelta(days=1)
NOW

RFM['TimeStamp'] = pd.to_datetime(RFM['TimeStamp'])

In [ ]:
RFM = RFM[RFM.UniSA_Customer_No != 9333734328]
RFM = RFM[RFM.UniSA_Customer_No != 693320906]
RFM = RFM[RFM.UniSA_Customer_No != 9721472842]
RFM = RFM[RFM.UniSA_Customer_No != 1408064326]
RFM

In [ ]:
NOW

In [ ]:
# Create a RFM table

RFM_table = RFM.groupby('UniSA_Customer_No').agg({'TimeStamp': lambda x: (NOW - x.max()).days, 'UniSA_Receipt_No1': lambda x: len(x), 'Item_Value': lambda x: x.sum()}).rename(columns = {"UniSA_Receipt_No1": "Frequency", "TimeStamp": "Recency", "Item_Value": "Monetary_Value"})
RFM_table

In [ ]:
# Split the metrics
# The easiest way to split metrics into segments is by using quartiles.This gives us a starting point for the detailed analysis.
# 4 segments are easy to understand and explain.

quantiles = RFM_table.quantile(q=[0.25,0.5,0.75])
quantiles

In [ ]:
# Arguments (x = value, p = recency, monetary_value, frequency, k = quartiles dict)
def R_Class(x,p,d):
    if x <= d[p][0.25]:
        return 4
    elif x <= d[p][0.50]:
        return 3
    elif x <= d[p][0.75]: 
        return 2
    else:
        return 1
    
# Arguments (x = value, p = recency, monetary_value, frequency, k = quartiles dict)
def FM_Class(x,p,d):
    if x <= d[p][0.25]:
        return 1
    elif x <= d[p][0.50]:
        return 2
    elif x <= d[p][0.75]: 
        return 3
    else:
        return 4

In [ ]:
# Create a segmented RFM table

RFM_Segment = RFM_table.copy()

# Arguments (x = value, p = recency, monetary_value, frequency, k = quartiles dict)
def R_Class(x,p,d):
    if x <= d[p][0.25]:
        return 4
    elif x <= d[p][0.50]:
        return 3
    elif x <= d[p][0.75]: 
        return 2
    else:
        return 1
    
# Arguments (x = value, p = recency, monetary_value, frequency, k = quartiles dict)
def FM_Class(x,p,d):
    if x <= d[p][0.25]:
        return 1
    elif x <= d[p][0.50]:
        return 2
    elif x <= d[p][0.75]: 
        return 3
    else:
        return 4
    
    
#RFM_Segment['R'] = RFM_Segment['Recency'].apply(RFMScore, args=('Recency',quantiles,))
#RFM_Segment['F'] = RFM_Segment['Frequency'].apply(RFMScore, args=('Frequency',quantiles,))
#RFM_Segment['M'] = RFM_Segment['Monetary_Value'].apply(RFMScore, args=('Monetary_Value',quantiles,))

RFM_Segment['R'] = RFM_Segment['Recency'].apply(R_Class, args=('Recency',quantiles,))
RFM_Segment['F'] = RFM_Segment['Frequency'].apply(FM_Class, args=('Frequency',quantiles,))
RFM_Segment['M'] = RFM_Segment['Monetary_Value'].apply(FM_Class, args=('Monetary_Value',quantiles,))

# Concat RFM quartile values to create RFM Segments
def join_rfm(x): return str(x['R']) + str(x['F']) + str(x['M'])
#RFM_Segment['RFM_Segment'] = RFM_Segment.apply(join_rfm, axis=1)

# Calculate RFM_Score
RFM_Segment['RFM_Score'] = RFM_Segment[['R','F','M']].sum(axis=1)

RFM_Segment['RFMClass'] = RFM_Segment.R.map(str) \
                            + RFM_Segment.F.map(str) \
                            + RFM_Segment.M.map(str)

RFM_Segment

In [ ]:
# Who are my best customers (Top 10)?

#RFMClass = 444

RFM_Segment[RFM_Segment['RFMClass']=='444'].sort_values('Monetary_Value', ascending=False).head(10)

In [ ]:
#test = RFM_Segment[RFM_Segment['Frequency'] > 2734]
#test

In [ ]:
# Who are the lost customers?

#Customers who's recency, frequency as well as monetary values are low 

RFM_Segment[RFM_Segment['RFMClass']=='111'].sort_values('Recency',ascending=False).head(10)

In [ ]:
#SuperCustomers['UniSA_Customer_No'].unique()

In [ ]:
# Create human friendly RFM labels
segt_map = {
    r'[1-2][1-2]': 'Hibernating',
    r'[1-2][2-3]': 'At Risk',
    r'[1-2]4': 'Can\'t Loose Them',
    r'2[1-2]': 'About To Sleep',
    r'22': 'Needs Attention',
    r'[2-3][3-4]': 'Loyal Customers',
    r'31': 'Promising',
    r'41': 'New Customers',
    r'[3-4][1-2]': 'Potential Loyalists',
    r'4[3-4]': 'Champions'
}
RFM_Segment['Segment'] = RFM_Segment['R'].map(str) + RFM_Segment['F'].map(str)
RFM_Segment['Segment'] = RFM_Segment['Segment'].replace(segt_map, regex=True)
RFM_Segment.head(40)

In [ ]:
# count the number of customers in each segment

segments_counts = RFM_Segment['Segment'].value_counts().sort_values(ascending=True)

fig, ax = plt.subplots()

bars = ax.barh(range(len(segments_counts)),
              segments_counts,
              color='cornflowerblue')
ax.set_frame_on(False)
ax.tick_params(left=False,
               bottom=False,
               labelbottom=False
               )
ax.set_yticks(range(len(segments_counts)))
ax.set_yticklabels(segments_counts.index, fontsize=15)

for i, bar in enumerate(bars):
        value = bar.get_width()
        if segments_counts.index[i] in ['Champions', 'Promising', 'Loyal Customers']:
            bar.set_color('orange')
        ax.text(value,
                bar.get_y() + bar.get_height()/2,
                    '{:,} ({:}%)'.format(int(value),
                                   int(value*100/segments_counts.sum())),
                va='center',
                ha='left',
                size=15
               )
        

plt.show()